
//Создайте React компонент Shopping Cart.
//
//Что должно быть в UI
//	1.	список товаров
//	2.	у каждого товара:
//	•	название
//	•	цена
//	•	кнопка Add to cart
//	3.	кнопка Change Theme
//	4.	блок корзины, где показывается:
//	•	сколько товаров добавлено
//	•	общая сумма корзины
//
//
//Логика
//	1.	При нажатии Add to cart товар добавляется в корзину
//	2.	Общая сумма должна считаться на основе массива корзины
//	3.	Кнопка Change Theme меняет только тему
//	4.	Пересчёт общей суммы не должен происходить заново, если поменялась только тема

export function ShoppingCart()  {
  return (

    <div>Shopping Cart</div>
  )
}
